d-h-k/Multi-Function-Shield_STM32-HAL/MFS_STM32_v2/fututure/MultiFuncShield.cpp
#include "MultiFuncShield.h"

#define BUTTON_SAMPLE_INTERVAL_SCALE  20
#define BUTTON_SAMPLE_INTERVAL  (1000 / BUTTON_SAMPLE_INTERVAL_SCALE)

MultiFuncShield MFS;

// Display specific variables
const byte LED[] = {LED_1_PIN, LED_2_PIN, LED_3_PIN, LED_4_PIN};

/* Segment byte maps for numbers 0 to 9 */
const byte SEGMENT_MAP_DIGIT[] = {0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0X80,0X90};
/* Segment byte maps for alpha a-z */
const byte SEGMENT_MAP_ALPHA[] = {136, 131, 167, 161, 134, 142, 144, 139 ,207, 241, 182, 199, 182, 171, 163, 140, 152, 175, 146, 135, 227, 182, 182, 182, 145, 182};
/* Byte maps to select digit 1 to 4 */
const byte SEGMENT_SELECT[] = {0xF1,0xF2,0xF4,0xF8};
const char DISPLAY_OVERFLOW_ERROR = 'E';
const byte BLINK_ON_COUNT = 65;
const byte BLINK_OFF_COUNT = 20;

volatile byte displayMemory[4] = {255,255,255,255};

#define	DISPLAY_TIMER_SCALER_RELOAD	4

volatile byte displayTimerScaler = DISPLAY_TIMER_SCALER_RELOAD;
volatile byte displayBrightness = 0;

// Sonar ranger specific variables

int sonarData[9];
byte sonarDataIndex = 0;

// LM35 specific variables

int lm35Data[8];
byte lm35DataIndex = 0;

// Misc methods and functions.
void isrWrapper ();
void WriteValueToSegment(byte Segment, byte Value);
byte AsciiToSegmentValue (byte ascii);
void writeBeeper (byte value);
byte readButton (byte btnIndex);
void writeLed(byte ledIdx, byte value);

int MedianOf9(int s0, int s1, int s2, int s3, int s4, int s5, int s6, int s7, int s8);
int MedianOf5(int s0, int s1, int s2, int s3, int s4);

// Pulse in counter port specifics.
uint8_t pulseInBit;
uint8_t pulseInPort;

// button port specfics
uint8_t buttonPort[3];
uint8_t buttonBit[3];


static void initShield()
{
    /* Set each LED pin to outputs */
  pinMode(LED[0], OUTPUT);
  pinMode(LED[1], OUTPUT);
  pinMode(LED[2], OUTPUT);
  pinMode(LED[3], OUTPUT);
  
  /* Turn all the LED's off */
  digitalWrite(LED[0], HIGH);
  digitalWrite(LED[1], HIGH);
  digitalWrite(LED[2], HIGH);
  digitalWrite(LED[3], HIGH);

  /* Set Segment display DIO pins to outputs */
  pinMode(LATCH_PIN,OUTPUT);
  pinMode(CLK_PIN,OUTPUT);
  pinMode(DATA_PIN,OUTPUT); 
  
  WriteValueToSegment(0,255);
  
  /* Set the buzzer pin to an output and turn the buzzer off */
  pinMode(BEEPER_PIN, OUTPUT);
  digitalWrite(BEEPER_PIN, HIGH);

  /* Set button pins to input */
  pinMode(A1, INPUT_PULLUP);
  pinMode(A2, INPUT_PULLUP);
  pinMode(A3, INPUT_PULLUP);
  
  int idx=0;
  buttonPort[idx] = digitalPinToPort(BUTTON_1_PIN);
  buttonBit[idx] = digitalPinToBitMask(BUTTON_1_PIN);
  idx++;
  buttonPort[idx] = digitalPinToPort(BUTTON_2_PIN);
  buttonBit[idx] = digitalPinToBitMask(BUTTON_2_PIN);
  idx++;
  buttonPort[idx] = digitalPinToPort(BUTTON_3_PIN);
  buttonBit[idx] = digitalPinToBitMask(BUTTON_3_PIN);

}

// ----------------------------------------------------------------------------------------------------

void MFS_initialize()
{
  initShield();
  // piggy back on to timer0, which is already set to approx 1khz.
  //OCR0A = 0xAF;
  //TIMSK0 |= _BV(OCIE0A);
}

// ----------------------------------------------------------------------------------------------------
void MFS_initSonar(byte level)
{
  sonarSmoothingLevel = level;
  sonarDataIndex = 0;
  
  for (int i=0; i < 9; i++)
  {
    sonarData[i] = 0;
  }
}


// ----------------------------------------------------------------------------------------------------
unsigned int MFS_getSonarDataCm(byte triggerPin, byte echoPin)
{
  uint8_t bit = digitalPinToBitMask(echoPin);
  uint8_t port = digitalPinToPort(echoPin);
  uint8_t stateMask = (HIGH ? bit : 0); 
  
  noInterrupts();
  digitalWrite(triggerPin, LOW); //Low, high and low level take a short time to TrigPin pulse
  delayMicroseconds(2);
  digitalWrite(triggerPin, HIGH);
  delayMicroseconds(10);
  digitalWrite(triggerPin, LOW);
  interrupts();
 
  // wait for any previous pulse to end
  while ((*portInputRegister(port) & bit) == stateMask) ; 

  // wait for the pulse to start
  while ((*portInputRegister(port) & bit) != stateMask) ; 

  unsigned long timeStart = micros();
  // wait for the pulse to stop
  while ((*portInputRegister(port) & bit) == stateMask) ; 

  sonarData [sonarDataIndex] = ((micros() - timeStart) * 141) >> 13;  // (value * 1.00) / 58
  
  int medianReading;
  
  if (sonarSmoothingLevel == SMOOTHING_NONE)
  {
    medianReading  = sonarData [sonarDataIndex];
  }
  else if (sonarSmoothingLevel == SMOOTHING_MODERATE)
  {
      sonarDataIndex++;
      if (sonarDataIndex >= 5)
      {
        sonarDataIndex = 0;
      }
      medianReading = MedianOf5(sonarData[0], sonarData[1], sonarData[2], sonarData[3], sonarData[4]);
  }
  else
  {
      sonarDataIndex++;
      if (sonarDataIndex >= 9)
      {
        sonarDataIndex = 0;
      }
      medianReading = MedianOf9(sonarData[0], sonarData[1], sonarData[2], sonarData[3], sonarData[4], sonarData[5], sonarData[6], sonarData[7], sonarData[8]);
  }
  
  return medianReading;
}


// ----------------------------------------------------------------------------------------------------
void MFS_initLM35(byte level)
{
  lm35SmoothingLevel = level;
  lm35DataIndex = 0;
  
  for (int i=0; i < 8; i++)
  {
    lm35Data[i] = 0;
  }
}


// ----------------------------------------------------------------------------------------------------
int MFS_getLM35Data()
{
  
  lm35Data [lm35DataIndex] = analogRead(LM35_PIN);
  
  int reading =0;
  
  if (lm35SmoothingLevel == SMOOTHING_NONE)
  {
    reading  = lm35Data [lm35DataIndex];
  }
  else if (lm35SmoothingLevel == SMOOTHING_MODERATE)
  {
      lm35DataIndex++;
      if (lm35DataIndex >= 4)
      {
        lm35DataIndex = 0;
      }
     
      for (int i=0; i<4; i++)
      {
        reading = reading + lm35Data[i];
      }
  }
  else
  {
      lm35DataIndex++;
      if (lm35DataIndex >= 8)
      {
        lm35DataIndex = 0;
      }

      for (int i=0; i<8; i++)
      {
        reading = reading + lm35Data[i];
      }
  }
  
  if (lm35SmoothingLevel == SMOOTHING_NONE)
  {
    return ((unsigned long)1250 * reading) >> 8;;
  }
  else if (lm35SmoothingLevel == SMOOTHING_MODERATE)
  {
    return ((unsigned long)1250 * reading) >> 10;
  }
  else
  {
    return ((unsigned long)1250 * reading) >> 11;
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_initPulseInCounter(byte pin, unsigned int timeOut, byte trigger)
{
  pulseInWriteInProgress = 1;

