d-h-k/Multi-Function-Shield_STM32-HAL/MFS_STM32_v2/fututure/MultiFuncShield.cpp
  pulseInBit = digitalPinToBitMask(pin);
  pulseInPort = digitalPinToPort(pin);
  
  pulseInTimeOut = timeOut;
  pulseInPin = pin;
  pulseInPeriodCounter =timeOut;
  pulseInPeriod_volatile =0;
  pulseInPeriod_safe =0;
  pulseInState =0;
  pulseInTrigger = trigger;
  pulseInTotalCount_volatile = 0;
  pulseInTotalCount_safe = 0;
  
  pulseInWriteInProgress = 0;
  pulseInEnabled = true;
}

void MFS_disablePulseInCounter ()
{
  pulseInEnabled = false;
}

// ----------------------------------------------------------------------------------------------------
unsigned int MFS_getPulseInPeriod()
{
  unsigned int period;
  
  pulseInReadInProgress = 1;
  period = pulseInPeriod_safe;
  pulseInReadInProgress =0;
  
  return period;
}


// ----------------------------------------------------------------------------------------------------
unsigned long MFS_getPulseInTotalCount()
{
  unsigned long count;
  
  pulseInReadInProgress = 1;
  count = pulseInTotalCount_safe;
  pulseInReadInProgress =0;
  
  return count;
}


// ----------------------------------------------------------------------------------------------------
void MFS_resetPulseInTotalCount()
{
  pulseInWriteInProgress = 1;
  pulseInTotalCount_volatile = 0;
  pulseInTotalCount_safe = 0;
  pulseInWriteInProgress = 0;
}


// ----------------------------------------------------------------------------------------------------
void MFS_setPulseInTimeOut(unsigned int timeOut)
{
  pulseInWriteInProgress = 1;
  pulseInTimeOut = timeOut;
  pulseInWriteInProgress = 0;
}


// ----------------------------------------------------------------------------------------------------
void MFS_queueButton (byte button)
{
  if (buttonBufferCount <= sizeof (buttonBuffer))
  {
    buttonBuffer [button_write_pos] = button;
    buttonBufferCount++;
    button_write_pos++;
    
    if (button_write_pos >= sizeof (buttonBuffer))
    {
      button_write_pos = 0;
    }
  }
}


// ----------------------------------------------------------------------------------------------------
byte MFS_getButton ()
{
  byte button = 0;
  
  if (buttonBufferCount > 0)
  {
    button = buttonBuffer [button_read_pos];
    buttonBufferCount--;
    button_read_pos++;
    
    if (button_read_pos >= sizeof (buttonBuffer))
    {
      button_read_pos = 0;
    }
  }
  
  return button;
}


// ----------------------------------------------------------------------------------------------------
void MFS_beep(unsigned int onPeriod, unsigned int offPeriod, byte cycles, unsigned int loopCycles, unsigned int loopDelayPeriod)
{
  cycles = cycles == 0 ? 1 : cycles;

  beeperModifyInProgress = 1;  // must do this first before changing volatile fields.
  
  if (onPeriod == 0)
  {
    digitalWrite(BEEPER_PIN, 1);  // turn off beeper immediately
  }
  
  beeperState = 0;
  beeperOnPeriodReloadValue = onPeriod * 10;
  beeperOffPeriodReloadValue = offPeriod * 10;
  beeperPeriodCounter = onPeriod * 10;
  
  beeperCycleReloadValue = cycles;
  beeperCycleCounter = cycles;
  
  beeperLoopCycleCounter = loopCycles;
  beeperLoopDelayPeriodReloadValue = loopDelayPeriod * 10;
  
  beeperModifyInProgress = 0; // must do this last.
}


// ----------------------------------------------------------------------------------------------------
void MFS_setBeepOffPeriod(unsigned int offPeriod)
{
  beeperModifyInProgress = 1;  // must do this first before changing volatile fields.
  
  if (beeperState == 1)
  {
    if (offPeriod * 10 < beeperPeriodCounter)
    {
      beeperPeriodCounter = offPeriod * 10;
    }
  }
  
  beeperOffPeriodReloadValue = offPeriod * 10;
  beeperModifyInProgress = 0; // must do this last.
}


// ----------------------------------------------------------------------------------------------------
//void MFS_setLedControlMask(byte controlMask)
//{
//  ledControlMask = controlMask;
//}


// ----------------------------------------------------------------------------------------------------
void MFS_writeLeds(byte leds, byte lit)
{
  if (lit)
  {
    ledState = ledState | leds;
    //ledControlMask = ledControlMask | leds;
  }
  else
  {
    ledState = ledState & (255 - leds);
    //ledControlMask = ledControlMask & (255 - leds);
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_blinkLeds(byte leds, byte enabled)
{
  if (enabled)
  {
    ledBlinkEnabled = ledBlinkEnabled | leds;
  }
  else
  {
    ledBlinkEnabled = ledBlinkEnabled & (255 - leds);
  }
}

// ----------------------------------------------------------------------------------------------------
void MFS_setDisplayBrightness(byte level)
{
  displayBrightness = level >= DISPLAY_TIMER_SCALER_RELOAD ? DISPLAY_TIMER_SCALER_RELOAD-1 : level;
}


// ----------------------------------------------------------------------------------------------------
void MFS_write(int integer)
{
  char displayText[5] = {' ',' ',' ',' ',0};
  
  if (integer > 9999 || integer < -999)
  {
    displayText[3] = DISPLAY_OVERFLOW_ERROR;
    write(displayText);
  }
  else if (integer == 0)
  {
    displayText[3] = '0';
    write (displayText);
  }
  else
  {
    byte sign = 0;
    if (integer < 0)
    {
      sign = 1;
      integer = integer * -1;
    }
    
    byte idx = 3;
    for (; idx >=0 && integer !=0; integer /= 10, idx--)
    {
      displayText[idx]=(integer % 10) + '0';
    }
    
    if (sign)
    {
      displayText[idx] = '-';
    }
    
    write (displayText);
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_write(float number, byte decimalPlaces)
{
  char outstr[7];
  dtostrf(number, 4, decimalPlaces, outstr);
 
  if (strlen(outstr) > 5)
  {
    outstr[0] = DISPLAY_OVERFLOW_ERROR;
    outstr[1] = 0;
  }
  write(outstr,1);
}


// ----------------------------------------------------------------------------------------------------
void MFS_write(const char *text, byte rightJustify)
{
  byte displayBuf[] = {0,0,0,0}, *pBuf = displayBuf;
  
  byte idx =0;
  
  for (; *text != 0 && idx < sizeof(displayBuf); text++)
  {
    byte offset = 0;
    
    if (*text == '.')
    {
      if (idx > 0)
      {
        displayBuf[idx-1] = displayBuf[idx-1] & 127;
      }
      else
      {
        displayBuf[idx] = AsciiToSegmentValue(*text);
        idx++;
      }
    }
    else
    {
      displayBuf[idx] = AsciiToSegmentValue(*text);
      idx++;
    }
  }
  
  for (; idx < sizeof(displayBuf); idx++)
  {
    displayBuf[idx] = 255;
  }
  
  // Copy display buffer to display memory
  
