d-h-k/Multi-Function-Shield_STM32-HAL/MFS_STM32_v2/fututure/MultiFuncShield.cpp
  if (rightJustify)
  {
    // right justify
    int i_src = sizeof(displayBuf)-1;
    int i_dst = sizeof(displayMemory)-1;
    
    for (; i_src >= 0 && displayBuf[i_src] == 255; i_src--) ;
      
    for (; i_src >= 0 && i_dst >= 0; i_src--, i_dst--)
    {
      displayMemory[i_dst] = displayBuf[i_src];
    }
    
    for (; i_dst >= 0; i_dst--)
    {
      displayMemory[i_dst] = 255;
    }
  }
  // left justify
  else
  {
    for (int i =0; i < sizeof(displayBuf); i++)
    {
      displayMemory[i] = displayBuf[i];
    }
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_blinkDisplay(byte digits, byte enabled)
{
  if (enabled)
  {
    blinkEnabled = blinkEnabled | digits;
  }
  else
  {
    blinkEnabled = blinkEnabled & (255 - digits);
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_setTimer(unsigned long thousandths)
{
  timerWriteInProgress = 1;
  timer_volatile = thousandths;
  timerWriteInProgress = 0;
  
  timerReadInProgress = 1;
  timer_safe = thousandths;
  timerReadInProgress = 0;
}


// ----------------------------------------------------------------------------------------------------
unsigned long MFS_getTimer()
{
  unsigned long timer;
  timerReadInProgress = 1;
  timer = timer_safe;
  timerReadInProgress = 0;

  return timer;
}


// ----------------------------------------------------------------------------------------------------
void MFS_wait(unsigned long thousandths)
{
  setTimer(thousandths);
  while (getTimer()) __asm__("nop\n\t""nop\n\t""nop\n\t""nop\n\t");
}


// ----------------------------------------------------------------------------------------------------
void MFS_isrCallBack()
{
  byte displayEnabled = 1;
  
  displayTimerScaler--;
  
  if (displayTimerScaler == 0)
  {
    displayTimerScaler = DISPLAY_TIMER_SCALER_RELOAD;
    
    // Global bink control
    if (blinkEnabled || ledBlinkEnabled)
    {
      blinkCounter++;
      if (blinkState)
      {
        displayEnabled = 1;
        if (blinkCounter > BLINK_ON_COUNT)
        {
          blinkState = 0;
          blinkCounter = 0;
          displayEnabled = 0;
        }
      }
      else
      {
        displayEnabled = 0;
        if (blinkCounter > BLINK_OFF_COUNT)
        {
          blinkState = 1;
          blinkCounter = 0;
          displayEnabled = 1;
        }
      }
    }

    
    // Digit display blink control
    if (blinkEnabled & (1 << displayIdx))
    {
      if (displayEnabled)
      {
        WriteValueToSegment(displayIdx, displayMemory[displayIdx]);
      }
      else
      {
        WriteValueToSegment(displayIdx, 255);
      }
    }
    else
    {
      WriteValueToSegment(displayIdx, displayMemory[displayIdx]);
    }
    
    displayIdx++;
    if (displayIdx > sizeof(displayMemory)-1)
    {
      displayIdx = 0;
    }
    
  
    // LED output and blink control.
    
    byte ledOutputNew = (ledState & (displayEnabled ? 255 : 0) & ledBlinkEnabled) | (ledState & ~ledBlinkEnabled);
    
    if (ledOutputNew != ledOutput)
    {
      for (byte ledIdx = 0; ledIdx < 4; ledIdx++)
      {
        if ((ledOutputNew ^ ledOutput) & (1 << ledIdx))    // only set LED if its state has changed
        {
          if (ledBlinkEnabled & (1 << ledIdx))
          {
            //digitalWrite(LED[ledIdx], !(displayEnabled && ledState & (1 << ledIdx)));
            writeLed(ledIdx, !(displayEnabled && ledState & (1 << ledIdx)));
          }
          else
          {
            //digitalWrite(LED[ledIdx], !(ledState & (1 << ledIdx)));
            writeLed(ledIdx, !(ledState & (1 << ledIdx)));
          }
        }
      }
      ledOutput = ledOutputNew;
    }
  }
  else
  {
    // Handle display brightness
    if (displayTimerScaler == displayBrightness)
    {
      WriteValueToSegment(displayIdx == 0 ? 3 : displayIdx-1, 255);
    }
  }

  // Beeper control.
  
  if (!beeperModifyInProgress && beeperOnPeriodReloadValue)
  {    
    if (beeperPeriodCounter == 0)
    {
      switch (beeperState)
      {
        case 0:  // on period
              if (beeperOffPeriodReloadValue)
              {
                beeperPeriodCounter = beeperOffPeriodReloadValue;
                beeperState = 1;
                break;
              }
              // Fall thru to next state immediately.
        case 1:  // off period
              beeperCycleCounter--;
              if (beeperCycleCounter)
              {
                beeperPeriodCounter = beeperOnPeriodReloadValue;
                beeperState = 0;
                break;
              }
              else
              {
                beeperCycleCounter = beeperCycleReloadValue;
                beeperPeriodCounter = beeperLoopDelayPeriodReloadValue;
                beeperState = 2;
                
                if (beeperLoopDelayPeriodReloadValue)
                {  
                  break;
                }
              }
              // Fall thru to next state immediately.
        case 2:  // loop cycle delay period
              if (beeperLoopCycleCounter == 0)  // loop beeper indefinitely
              {
                beeperPeriodCounter = beeperOnPeriodReloadValue;
                beeperState = 0;
              }
              else
              {
                beeperLoopCycleCounter--;
                if (beeperLoopCycleCounter == 0)
                {          
                  beeperOnPeriodReloadValue = 0;    // beeper activity has now ended.
                  //digitalWrite(BEEPER_PIN, 1);
                  writeBeeper(1);
                }
                else
                {
                  beeperPeriodCounter = beeperOnPeriodReloadValue;
                  beeperState = 0;
                }
              }
              break;
      }
    }
    
    if (beeperPeriodCounter)
    {
      beeperPeriodCounter--;
    }
    
    if (beeperState == 0)
    {
      // beep on
      //digitalWrite(BEEPER_PIN, 0);
      writeBeeper(0);
    }
    else
    {
      // beep off
      //digitalWrite(BEEPER_PIN, 1);
      writeBeeper(1);
    }
  }
   

