d-h-k/Multi-Function-Shield_STM32-HAL/MFS_STM32_v2/fututure/MultiFuncShield.cpp
  // Bump button sample interval counter
  
  if (buttonSampleIntervalCounter++ >= BUTTON_SAMPLE_INTERVAL)
  {
    buttonSampleIntervalCounter =0;
    
    byte btnStateNow;
    
    for (int i=0; i < BUTTON_COUNT; i++)
    {
      //btnStateNow = !digitalRead(buttonPins[i]);
      //btnStateNow = !readButton(i);
      btnStateNow = !(*portInputRegister(buttonPort[i]) & buttonBit[i]);
      
      // If button state has changed, action the change.
      if (buttonState[i] != btnStateNow)
      {
        // if button state changes to pressed, queue SHORT PRESS to buffer.
        if (btnStateNow)
        {
          queueButton((i+1) | BUTTON_PRESSED_IND);
        }
        else
        {
          // otherwise button state has changed to up, queue SHORT or LONG RELEASE state to buffer, and reset pressed time counter.
          if (buttonPressTime[i] > (1000 / BUTTON_SAMPLE_INTERVAL))
          {
            queueButton((i+1) | BUTTON_LONG_RELEASE_IND);
          }
          else
          {
            queueButton((i+1) | BUTTON_SHORT_RELEASE_IND);
          }
          buttonPressTime[i] = 0;
        }
        buttonState[i] = btnStateNow;
      }

      // if button state pressed, increment pressed time counter. Queue LONG PRESS to buffer, if button is held long.  
      if (btnStateNow)
      {
        if (buttonPressTime[i] > (1000 / BUTTON_SAMPLE_INTERVAL) && (buttonPressTime[i] & 3) == 0)
        {
          queueButton((i+1) | BUTTON_LONG_PRESSED_IND);
        }
        
        if (buttonPressTime[i] < 65535)
        {
          buttonPressTime[i]++;
        }
      }
    }    
  }

  // Pulse in processing
  
  if (pulseInEnabled && !pulseInWriteInProgress)
  {
    //byte pulseInStateNow = digitalRead(pulseInPin);
    byte pulseInStateNow = (*portInputRegister(pulseInPort) & pulseInBit ? 1 : 0);
    
    // Has the state of the pulse changed?
    if ((pulseInState != pulseInStateNow) && (pulseInStateNow == pulseInTrigger))
    {
      pulseInTotalCount_volatile++;
      
      pulseInPeriod_volatile = (pulseInPeriodCounter >= pulseInTimeOut ? 0 : pulseInPeriodCounter);
      pulseInPeriodCounter = 0;
    }
    else
    {
      if (pulseInPeriodCounter < pulseInTimeOut)
      {
        pulseInPeriodCounter++;
      }
      else
      {
        pulseInPeriod_volatile = 0;
      }
    }

    if (!pulseInReadInProgress)
    {
      pulseInPeriod_safe = pulseInPeriod_volatile;
      pulseInTotalCount_safe = pulseInTotalCount_volatile;
    }
      
    if (pulseInState != pulseInStateNow)
    {
      pulseInState = pulseInStateNow;
    }
  }

  // Bump the count down timer.
  if (timer_volatile && !timerWriteInProgress)
  {
    timer_volatile--;
  }
  
  if (!timerReadInProgress)
  {
    timer_safe = timer_volatile;
  }
  
  if (userInterrupt)
  {
    userInterrupt();
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_manualDisplayRefresh()
{
  WriteValueToSegment(displayIdx, displayMemory[displayIdx]);
  
  displayIdx++;
  if (displayIdx > sizeof(displayMemory)-1)
  {
    displayIdx = 0;
  }
}


// ----------------------------------------------------------------------------------------------------
void MFS_manualButtonHandler()
{
  byte btnStateNow;
  
  for (int i=0; i < BUTTON_COUNT; i++)
  {
    //btnStateNow = !digitalRead(buttonPins[i]);
    btnStateNow = !(*portInputRegister(buttonPort[i]) & buttonBit[i]);
    // If button state has changed, action the change.

    if (buttonState[i] != btnStateNow)
    {
      // if button state changes to pressed, queue SHORT PRESS to buffer.
      if (btnStateNow)
      {
        queueButton((i+1) | BUTTON_PRESSED_IND);
      }
      else
      {
        // otherwise button state has changed to up, queue SHORT RELEASE state to buffer.
        queueButton((i+1) | BUTTON_SHORT_RELEASE_IND);
      }
      buttonState[i] = btnStateNow;
    }
  }
}


// ----------------------------------------------------------------------------------------------------
//void isrWrapper ()
//{
//  MFS.isrCallBack();
//}

SIGNAL(TIMER0_COMPA_vect)
{
  MFS.isrCallBack();
}

// ----------------------------------------------------------------------------------------------------
byte AsciiToSegmentValue (byte ascii)
{
  byte segmentValue = 182;
  
  if (ascii >= '0' && ascii <= '9')
  {
    segmentValue = SEGMENT_MAP_DIGIT[ascii - '0'];
  }
  else if (ascii >= 'a' && ascii <='z')
  {
    segmentValue = SEGMENT_MAP_ALPHA[ascii - 'a'];
  }
  else if (ascii >= 'A' && ascii <='Z')
  {
    segmentValue = SEGMENT_MAP_ALPHA[ascii - 'A'];
  }
  else
  {
    switch (ascii)
    {
      case '-':
        segmentValue = 191;
        break;
      case '.':
        segmentValue = 127;
        break;
      case '_':
        segmentValue = 247;
        break;
      case ' ':
        segmentValue = 255;
        break;
    }
  }
  
  return segmentValue;
}

// ----------------------------------------------------------------------------------------------------
int MedianOf5(int s0, int s1, int s2, int s3, int s4)
{
  int tmp;

  if (s1 > s2)
  {
    tmp = s1;
    s1 = s2;
    s2 = tmp;
  }
  
  if (s0 > s1)
  {
    tmp = s0;
    s0 = s1;
    s1 = tmp;
  }
  if (s3 > s4)
  {
    tmp = s3;
    s3 = s4;
    s4 = tmp;
  }
  
  if (s1 > s2)
  {
    tmp = s1;
    s1 = s2;
    s2 = tmp;
  }
  
  if (s0 > s3)
  {
    s3 = s0;
  }
  
  if (s1 > s4)
  {
    s1 = s4;
  }
  
  if (s1 > s3)
  {
    s3 = s1;
  }
  
  if (s2 > s3)
  {
    s2 = s3;
  }

  return s2;
}


// ----------------------------------------------------------------------------------------------------
// Find the median value, given nine data samples. 
int MedianOf9(int s0, int s1, int s2, int s3, int s4, int s5, int s6, int s7, int s8)
{
  int tmp;

  if (s1 > s2)
  {
    tmp = s1;
    s1 = s2;
    s2 = tmp;
  }
  if (s4 > s5)
  {
    tmp = s4;
    s4 = s5;
    s5 = tmp;
  }
  if (s7 > s8)
  {
    tmp = s7;
    s7 = s8;
    s8 = tmp;
  }
  
  if (s0 > s1)
  {
    tmp = s0;
    s0 = s1;
    s1 = tmp;
  }
  if (s3 > s4)
  {
    tmp = s3;
    s3 = s4;
    s4 = tmp;
  }
  if (s6 > s7)
  {
    tmp = s6;
    s6 = s7;
    s7 = tmp;
  }
  
