d-h-k/Multi-Function-Shield_STM32-HAL/MFS_STM32_v2/fututure/MultiFuncShield.cpp
  if (s1 > s2)
  {
    tmp = s1;
    s1 = s2;
    s2 = tmp;
  }
  if (s4 > s5)
  {
    tmp = s4;
    s4 = s5;
    s5 = tmp;
  }
  if (s7 > s8)
  {
    tmp = s7;
    s7 = s8;
    s8 = tmp;
  }
  
  if (s3 > s6)
  {
    tmp = s3;
    s3 = s6;
    s6 = tmp;
  }
  if (s4 > s7)
  {
    tmp = s4;
    s4 = s7;
    s7 = tmp;
  }
  if (s5 > s8)
  {
    s5 = s8;
  }
  if (s0 > s3)
  {
    tmp = s0;
    s3 = tmp;
  }
  
  if (s1 > s4)
  {
    tmp = s1;
    s1 = s4;
    s4 = tmp;
  }
  if (s2 > s5)
  {
    s2 = s5;
  }
  if (s3 > s6)
  {
    tmp = s3;
    s3 = s6;
    s6 = tmp;
  }
  
  if (s4 > s7)
  {
    s4 = s7;
  }
  if (s1 > s3)
  {
    s3 = s1;
  }
  
  if (s2 > s6)
  {
    tmp = s2;
    s2 = s6;
    s6 = tmp;
  }
  
  if (s2 > s3)
  {
    s3 = s2;
  }
  if (s4 > s6)
  {
    s4 = s6;
  }
  
  if (s3 > s4)
  {
    s4 = s3;
  }
  return s4;
}

/* ---------------------------------------------------------------------- */

#if defined(__AVR_ATmega328P__)      // Uno

  /* Write a value to one of the 4 digits of the display */
  void WriteValueToSegment(byte Segment, byte Value)
  {
    bitClear(PORTD, 4);

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTB, 0, !!(Value & (1 << (7 - i))));
      bitSet(PORTD, 7);
      bitClear(PORTD, 7);
    } 

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTB, 0, !!(SEGMENT_SELECT[Segment] & (1 << (7 - i))));
      bitSet(PORTD, 7);
      bitClear(PORTD, 7);          
    } 

    bitSet(PORTD, 4);
  }
  
  void writeBeeper (byte value)
  {
    bitWrite(PORTD, 3, value);
  }
  
  void writeLed(byte ledIdx, byte value)
  {
    switch (ledIdx)
    {
    case 0:
      bitWrite(PORTB, 5, value);
      break;
    case 1:
      bitWrite(PORTB, 4, value);
      break;
    case 2:
      bitWrite(PORTB, 3, value);
      break;
    case 3:
      bitWrite(PORTB, 2, value);
      break;
      }
  }

#elif defined(__AVR_ATmega32U4__)   // Leonardo

  /* Write a value to one of the 4 digits of the display */
  void WriteValueToSegment(byte Segment, byte Value)
  {
    bitClear(PORTD, 4);

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTB, 4, !!(Value & (1 << (7 - i))));
      bitSet(PORTE, 6);
      bitClear(PORTE, 6);
    } 

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTB, 4, !!(SEGMENT_SELECT[Segment] & (1 << (7 - i))));
      bitSet(PORTE, 6);
      bitClear(PORTE, 6);
    } 

    bitSet(PORTD, 4);
  }
  
  void writeBeeper (byte value)
  {
    bitWrite(PORTD, 0, value);
  }
  
  void writeLed(byte ledIdx, byte value)
  {
    switch (ledIdx)
    {
    case 0:
      bitWrite(PORTC, 7, value);
      break;
    case 1:
      bitWrite(PORTD, 6, value);
      break;
    case 2:
      bitWrite(PORTB, 7, value);
      break;
    case 3:
      bitWrite(PORTB, 6, value);
      break;
      }
  }
  
#elif defined(__AVR_ATmega2560__) // Mega 2560

/* Write a value to one of the 4 digits of the display */
/*
void WriteValueToSegment(byte Segment, byte Value)
{
  digitalWrite(LATCH_PIN,LOW);
  shiftOut(DATA_PIN, CLK_PIN, MSBFIRST, Value); 
  shiftOut(DATA_PIN, CLK_PIN, MSBFIRST, SEGMENT_SELECT[Segment] );
  digitalWrite(LATCH_PIN,HIGH);
}
*/

  /* Write a value to one of the 4 digits of the display */
  void WriteValueToSegment(byte Segment, byte Value)
  {
    bitClear(PORTG, 5);

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTH, 5, !!(Value & (1 << (7 - i))));
      bitSet(PORTH, 4);
      bitClear(PORTH, 4);
    } 

    for (uint8_t i = 0; i < 8; i++)  {
      bitWrite(PORTH, 5, !!(SEGMENT_SELECT[Segment] & (1 << (7 - i))));
      bitSet(PORTH, 4);
      bitClear(PORTH, 4);          
    } 

    bitSet(PORTG, 5);
  }
 
  void writeBeeper (byte value)
  {
    bitWrite(PORTE, 5, value);
  }
  
  void writeLed(byte ledIdx, byte value)
  {
    switch (ledIdx)
    {
    case 0:
      bitWrite(PORTB, 7, value);
      break;
    case 1:
      bitWrite(PORTB, 6, value);
      break;
    case 2:
      bitWrite(PORTB, 5, value);
      break;
    case 3:
      bitWrite(PORTB, 4, value);
      break;
      }
  }
#endif
